reddit_clone/app/views/posts/_comment.html.erb

    <ul>
      <% comment.child_comments.each do |child_cmnt| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]