reddit_clone/app/views/posts/show.html.erb

<ul>
  <% @post.subs.each do |sub| %>
---
SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 2]]

  <% if false %>
    <% @post.top_level_comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]