ninetynine_cats/app/controllers/cat_rental_requests_controller.rb

SELECT  "cats".* FROM "cats" WHERE (5) LIMIT $1  [["LIMIT", 1]]
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def new
    @cats = Cat.all
    @cat = Cat.find_by(id: params[:cat_id])

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 5], ["start_date", "2021-12-23"], ["end_date", "2021-12-31"], ["created_at", "2021-12-23 18:09:29.842787"], ["updated_at", "2021-12-23 18:09:29.842787"]]
---
  def create
    @cat_rental_request = CatRentalRequest.new(cat_rental_request_params)

    if @cat_rental_request.save

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def approve
    @request = CatRentalRequest.find_by(id: params[:id])

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def deny
    @request = CatRentalRequest.find_by(id: params[:id])