reddit_clone/app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("value", "votable_type", "votable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["value", 1], ["votable_type", "Comment"], ["votable_id", 1], ["created_at", "2022-02-23 13:42:28.088926"], ["updated_at", "2022-02-23 13:42:28.088926"]]
---
  def upvote
    comment = Comment.find_by(id: params[:id])
    comment.votes.create(value: 1)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "je ris oh!!!"], ["author_id", 2], ["post_id", 2], ["created_at", "2022-02-22 10:14:05.572447"], ["updated_at", "2022-02-22 10:14:05.572447"]]
INSERT INTO "votes" ("value", "votable_type", "votable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["value", -1], ["votable_type", "Comment"], ["votable_id", 2], ["created_at", "2022-02-23 13:47:30.521162"], ["updated_at", "2022-02-23 13:47:30.521162"]]
---
  def downvote
    comment = Comment.find_by(id: params[:id])
    comment.votes.create(value: -1)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @comment = Comment.find_by(id: params[:id])

INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "zfiojhfioze"], ["author_id", 1], ["post_id", 5], ["created_at", "2022-03-02 18:28:39.618582"], ["updated_at", "2022-03-02 18:28:39.618582"]]
---
  def create
    @comment = current_user.comments.new(comment_params)

    if @comment.save