reddit_clone/app/controllers/posts_controller.rb

  def upvote
    post = Post.find_by(id: params[:id])
    post.votes.create(value: 1)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "votes" ("value", "votable_type", "votable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["value", 1], ["votable_type", "Post"], ["votable_id", 2], ["created_at", "2022-02-23 15:11:50.611485"], ["updated_at", "2022-02-23 15:11:50.611485"]]

  def downvote
    post = Post.find_by(id: params[:id])
    post.votes.create(value: -1)
---
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "New missile"], ["url", ""], ["content", "Missile launching in pacific"], ["author_id", 1], ["created_at", "2022-02-21 21:41:53.175602"], ["updated_at", "2022-02-21 21:41:53.175602"]]

  def create
    @post = current_user.posts.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Cookies"], ["url", "hjklbnjkzfl"], ["content", "zsfzefzef"], ["author_id", 1], ["created_at", "2022-03-02 18:27:29.471316"], ["updated_at", "2022-03-02 18:27:29.471316"]]

  def update
    @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]