reddit_clone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @sub = Sub.find_by(id: params[:id])

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @sub = current_user.subs.new(sub_params)

    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "Subreddit dedicated to the news and discussions about the creation and use of technology and its surrounding issues"], ["updated_at", "2022-02-19 10:55:24.462405"], ["id", 3]]
---
  def update
    @sub = Sub.find_by(id: params[:id])

    if @sub.update_attributes(sub_params)