music_app/app/views/albums/_form.html.erb

SELECT "bands".* FROM "bands"
---
    <select name="album[band_id]" id="album_band_id">
      <% Band.all.each do |band| %>