music_app/app/controllers/albums_controller.rb

  def show
    @album = Album.find_by(id: params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def create
    @album = Album.new(album_params)

    if @album.save
---
INSERT INTO "albums" ("title", "year", "created_at", "updated_at", "band_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Héritiers"], ["year", 2020], ["created_at", "2022-01-10 17:18:22.391625"], ["updated_at", "2022-01-10 17:18:22.391625"], ["band_id", 3]]

  def destroy
    album = Album.find_by(id: params[:id])

    if album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 1]]