music_app/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @band = Band.find_by(id: params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @band = Band.find_by(id: params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "First band"], ["updated_at", "2022-01-07 13:51:32.250587"], ["id", 1]]
---
  def update
    band = Band.find_by(id: params[:id])

    if band.update(band_params)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]
---
  def destroy
    band = Band.find_by(id: params[:id])

    if band.destroy