music_app/app/controllers/notes_controller.rb

INSERT INTO "notes" ("content", "track_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "good song !"], ["track_id", 5], ["created_at", "2022-01-11 17:55:22.004188"], ["updated_at", "2022-01-11 17:55:22.004188"], ["user_id", 2]]
---
  def create
    @note = current_user.notes.new(note_params)

    if @note.save

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 1]]
---
  def destroy
    note = Note.find_by(id: params[:id])

    if !note.nil? && note.user_id == current_user.id
      note.destroy