art_share_api/app/controllers/artworks_controller.rb

  def index
    user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def create
    artwork = Artwork.new(artwork_params)

    if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Goli"], ["image_url", "www.artworks.com/images/goli_img"], ["artist_id", 7]]

  def update
    artwork = Artwork.find(params[:user_id])

    if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1 WHERE "artworks"."id" = $2  [["title", "Golikpakoue"], ["id", 5]]

  def destroy
    artwork = Artwork.find(params[:id])
    artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 5]]