art_share_api/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."author_id" = $1  [["author_id", 13]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 11]]
---
  def index
    case
    when params[:user_id]
      comments = Comment.where(author_id: params[:user_id])
    when params[:artwork_id]
      comments = Comment.where(artwork_id: params[:artwork_id])

INSERT INTO "comments" ("body", "author_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "how did you do that?"], ["author_id", 13], ["artwork_id", 12], ["created_at", "2021-12-17 10:57:34.579526"], ["updated_at", "2021-12-17 10:57:34.579526"]]
---
  def create
    comment = Comment.new(comment_params)

    if comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]
---
  def destroy
    comment = Comment.find(params[:id])
    comment.destroy