art_share_api/app/controllers/users_controller.rb

  def index
    users = User.all

    if params[:username]
      render json: users.where(username: params[:username])
---
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "kym"]]

  def update
    user = User.find(params[:id])
    success = user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "jb"], ["email", "jb@mail.com"], ["updated_at", "2021-12-15 15:12:22.760150"], ["id", 3]]