ninetynine_cats/app/models/cat_rental_request.rb

  def approve!
    ActiveRecord::Base.transaction do
      self.status = 'APPROVED'

      self.save!
---
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2021-12-24 13:49:24.616163"], ["id", 5]]

  def deny!
    self.update_attribute(:status, 'DENIED')
---
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2021-12-24 15:00:35.165637"], ["id", 7]]