URLShortener/app/models/shortened_url.rb

  def self.random_code
    loop
      code = SecureRandom.urlsafe_base64
      return code unless ShortenedUrl.exists?(:short_url => code)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "DGne7OZplt9fG8qTrHHtPQ"], ["LIMIT", 1]]

  def self.create_short_url_for_user(user, long_url)
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"