URLShortener/app/models/visit.rb

INSERT INTO "visits" ("user_id", "short_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 6], ["short_url_id", 5], ["created_at", "2021-11-23 09:21:21.964008"], ["updated_at", "2021-11-23 09:21:21.964008"]]
---
  def self.record_visit!(user, shortened_url)
    Visit.create!({
      user_id: user.id,
      short_url_id: shortened_url.id
    })