music_app/app/views/tracks/_form.html.erb

SELECT "albums".* FROM "albums"
---
    <select name="track[album_id]" id="track_album_id">
      <% Album.all.each do |album| %>